XWS-SOAP/initData/clearingEnvelope.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body>
    <m:obaviClearing xmlns:m="http://xws/tim7/banka">
    </m:obaviClearing>
  </soap:Body>
</soap:Envelope>